Tutorials1/QGDFoam/2D/LandenburgJet60psi/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 271724;
    }

    outlet
    {
        type            waveTransmissive;
        field           p;
        psi             thermo:psi;
        fieldInf        101325;
        gamma           1.4;
        lInf            0.025;
        value           uniform 101325;
    }

    freestream
    {
        type            totalPressure;
        value           uniform 101325;
        p0              uniform 101325;
        rho             none;
        psi             thermo:psi;
        gamma           1.4;
    }

    freestreamInlet
    {
        type            zeroGradient;
    }

    wedge1 {type wedge;}
    wedge2 {type wedge;}
}

// ************************************************************************* //
